load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 60
      arrivalRate: 50
      name: "Load test"

scenarios:
  - name: "Login flow"
    flow:
      - post:
          url: "/users/login"
          json:
            email: "test@example.com"
            password: "Test@1234"